{
  "link": "https://www.reddit.com/r/resumes/comments/1nq7vdy/20_yoe_senior_graphic_designer_senior_graphic/",
  "title": "[20 YoE, Senior Graphic Designer, Senior Graphic Designer, USA]",
  "text": "Contact  \nMichael Crawford  \nmichael.crawford.design@example.com  \n(312) 555-0147 | Chicago, IL | michaelcrawforddesign.com  \n\nSoftware  \nAdobe Creative Cloud  \nIllustrator, Photoshop, InDesign  \n\nFigma  \nCanva  \n\nMicrosoft Office Suite  \nWord, Excel, PowerPoint, Outlook  \n\nMac and Windows OS  \nSmartsheet  \nSalesforce  \n\nSkills  \n• Marketing and Advertising Design  \n• Large and Small-format Graphic Design  \n• Brand Identity and Management  \n• Logo Design  \n• Iconography  \n• Web, Mobile, Email, and Digital Marketing  \n• Conceptual Design  \n• Illustration  \n• Typography  \n• Image Composition  \n• Retouching and Color Correction  \n• Prepress and Print Production  \n\n• Communication and Collaboration  \n• Adaptability and Reliability  \n• Detail Driven  \n• Problem Solving  \n• Empathy and Patience  \n\nMichael Crawford  \n\nSkilled Graphic Designer and Illustrator  \n\nWith over 20 years of graphic design expertise, I bring a proven track record of delivering exceptional creative solutions, from high-impact collateral and unforgettable logos to sleek, cohesive iconography, unique plush toys, and essential product designs. Backed by outstanding illustration skills, I combine passion and precision in every project. As a strong communicator, collaborator, and mentor, I excel at building lasting relationships and turning ideas into visually compelling results.  \n\nProfessional Experience  \nBlue Ridge Outdoor Products, Inc.  \nSenior Graphic Designer  |  February 2005 - August 2025  \n\n• Designed a vast range of exciting print and digital marketing collateral, including catalogs, flyers, postcards, inserts, mailers, social media images, and tradeshow graphics to energize the sales team, motivate end-users, and generate revenue.  \n\n• Awarded a U.S. patent US 8,765,432 for the innovative design of the SummitGrip Pen, a bestseller in the Executive Signature Collection.  \n\n• Led the transformation of our visual language by unifying the catalog and website’s scattered icon styles into one cohesive system. Developed and delivered over 100 sleek, modern monoline icons, elevating the brand with a polished and professional look.  \n\n• Entrusted with reimagining the beloved ChillMate brand, a promotional product icon since the can cooler’s invention in 1979. The result was a perfect evolution: a dynamic, colorful logo that captures the spirit of a friendly outdoor category.  \n\n• Played a key role in the bold 2021 rebranding of Coolers Unlimited to Ridge & River, a sweeping, multi-layered transformation that revitalized the company’s visual identity and brand voice, infusing it with a fresh, fun, and approachable personality.  \n\n• Worked closely with the direct-to-consumer manager to develop and launch fun, visually striking packaging to introduce the TrailSip brand to the retail world. Drinkware packaging received Graphic Design USA’s 2019 American Inhouse Design Award.  \n\n• Designed a diverse range of custom promotional products, including digital pen wraps, backpacks, keychains, plush toys, and more for a variety of clients. Notably developed a series of agriculture-themed drawstring bags for Heartland AgriSupply Co.  \n\n• Developed 22 unique plush toy designs for SunnySide Family Restaurants, with several making it from sketchpad to store shelves and now delighting guests in 436 restaurants nationwide.  \n\nEducation  \nMidwest Institute of Design & Technology (MIDT)  \nBachelor of Fine Arts Digital Art & Technology"
}
