{
  "link": "https://www.reddit.com/r/resumes/comments/1looypn/5_yoe_unemployed_graphic_designer_usa/",
  "title": "[5 YoE, Unemployed, Graphic Designer, USA]",
  "text": "Nolan Nickel  \nnolan.nickel@email.com | (555) 012-3456 | Los Angeles, CA | nolannickel.design | linkedin.com/in/nolannickel\n\nPROFILE\n\nGraphic Designer with 5+ years of experience delivering high-impact visual solutions across digital and print for mission-driven, B2B, and nonprofit brands. Proven success leading cross-functional design projects that strengthen brand presence, boost engagement, and drive strategic growth. Adept at translating complex ideas into clear, purpose-driven visuals, including presentations, reports, social media campaigns, and event collateral that build trust and resonate with diverse audiences. Proficient in Adobe Creative Suite, PowerPoint, WordPress, and Figma.\n\nDESIGN SKILLS\n\nBranding • Presentation Design • Illustration • Event Collateral • Layout Design • Print Design  \nAnimation • Social Media Content • Photography • Video Editing • Basic Animation • Web Graphics\n\nSOFTWARE\n\nInDesign • Photoshop • Illustrator • After Effects • Premiere Pro • Lightroom • Canva\n\nEXPERIENCE\n\nFreelance Graphic Designer  \nBrightwood Studio | 2023 – Present  \n• Drive brand visibility by creating high-impact design solutions and sales enablement materials, including presentations, for nonprofit and B2B clients.  \n• Drive engagement and conversions by designing cross-platform campaigns, including one-pagers, social content, and email graphics.  \n• Accelerate project turnaround by managing multiple design requests efficiently in agile, remote workflows.\n\nGraphic Designer  \nEden Reforestation Projects | 2020 – 2023  \n• Strengthened brand recognition by evolving and applying brand guidelines across marketing campaigns, annual reports, and donor communications.  \n• Increased team efficiency by creating scalable design systems to unify brand execution across global markets.  \n• Standardized global reporting and improved cross-team efficiency by designing report templates and training international marketing teams in remote environments.  \n• Enhanced campaign performance by creating cross-platform marketing materials designed for seamless remote collaboration.  \n• Managed end-to-end print production process including file prep, vendor coordination, and press checks for event materials and donor communications.\n\nGraphic Designer  \nMisaine | 2019 – 2020  \n• Elevated seasonal product appeal by creating original artwork and illustrations aligned with current trends.  \n• Strengthened brand consistency and shelf impact by contributing to package design across product lines.  \n• Enhanced production quality and efficiency by improving communication with manufacturing teams.  \n• Secured stakeholder buy-in by developing clear, compelling presentations for seasonal product pitches.\n\nGraphic Designer  \nLong Beach Blues Society | 2018 – 2019  \n• Expanded audience reach and increased conversions by designing targeted marketing collateral and display ads for digital and print channels.  \n• Boosted fundraising event outreach effectiveness by designing clear, on-brand visual assets aligned with campaign goals.  \n• Optimized creative workflows and maintained high-quality output through process improvements.\n\nEDUCATION\n\nUniversity of California Los Angeles  \nDesign Communication Arts Certificate\n\nThe Art Institute of California  \nBachelor of Science in Digital Filmmaking\n\nLANGUAGES\n\nEnglish • Spanish"
}
