{
  "link": "https://www.reddit.com/r/resumes/comments/1j92ir0/2_yoe_unemployed_3d_artist_w_graphic_design/",
  "title": "[2 YoE, Unemployed, 3D Artist w/ Graphic Design knowledge, Spain or Remote Work]",
  "text": "Novak Marco  \n3D Artist  \n\n**Contact**  \nPhone number: +34 600-00-00-00  \nEmail: novak.marco.contact@example.com  \nOnline Porfolio: Novak Marco  \nSocial Media: @novak.marco  \nLinkedIn: Novak Marco  \n\n**Expertise**  \n• Management of 3D software programs/plugins: Autodesk Maya, Autodesk 3Ds Max, Blender, Marmoset Toolbag, Zbrush, Unity 3D, Unreal Engine, SideFX Houdini, Knald, Fortnite Porting and Chaos Corona.  \n• Known programming languages: C# and VEX.  \n• Proficiency in the Adobe Suite: Adobe Photoshop, Adobe After Effects, Adobe Illustrator, Adobe Substance 3D Painter, Adobe Premiere Pro and Adobe Media Encoder.  \n• Management of software with AI tools: Topaz Photo AI and Topaz Video AI  \n\n**Languages**  \nSpanish: Native  \nEnglish: Conversational (Professional)  \nGallego: Basic  \n\n**Professional Experience**  \nSep 2024 - Jan 2025  \nJr 3D Artist  \nPixelHarbor Studio  \n• Original Render Creation: Developed a well-defined 3D assets, creating a base render to serve as a strong foundation for future edits.  \n• Step-by-Step Visual Editing: Produced a series of consecutive renders (2, 3, 4, and 5), progressively adding or removing visual elements.  \n• Consistent Modification Retention: Ensured that each stage retained all previous edits, maintaining a seamless progression toward the final render.  \n• Final Render Integration: Combined all prior modifications into the final render, presenting a fully transformed and polished version of the project.  \n\nAug 2023 - Sep 2024  \nFreelance 3D Artist & Graphic Design  \nIndigo Static Collective | Madrid  \n• 3D Asset Creation & Rendering: Designed and rendered stages, characters, and props based on client specifications, ensuring a cohesive visual style.  \n• Composition & Post-Production: Edited and composed rendered elements using external editing software such as Photoshop to achieve the desired aesthetic.  \n• Logo Design: Developed logos for the group, adhering to client guidelines while also exploring alternative designs and variations.  \n• Mockup Creation: Designed realistic mockups to showcase how logos and visuals would appear on T-shirts, stickers, album covers, and other merchandise.  \n\nOct 2020 - Dec 2022  \nFreelance 3D Artist  \nVarious Clients | Madrid  \n• 3D Modeling & Animation: Creation of low-poly and stylized 3D animated avatars, including enviroment building, prop adition, particle system management and custom shader creation, adhering to client specifications and deadlines.  \n• Client Collaboration: Worked closely with clients, understanding project requeriments, providing creative solutions and ensuring high-quality products, along with the client satisfaction.  \n• Software Profiency: Utilized industry-standard software such as Blender, Autodesk Maya and Zbrush with some compositing programs like After Effects to produce visually compelling 3D assets.  \n• Project Management: Managed multiple concurrent projects, adjusting workflows to meet client needs and project timelines.  \n\n---  \n\nNovak Marco  \n3D Artist  \n\n**More About me**  \n• I am quite an enthusiast when it comes to games, relishing both video games and board games that are challenging and tough.  \n• I have a passion for reading manga from the artist Junji Ito, also enjoying the artistry of Kentaro Miura (Berserk) and Hirohiko Araki (JoJo’s Bizarre Adventure).  \n• Creating 3D models is something I greatly enjoy, allowing my imagination to flow and crafting the most intriguing ones.  \n• I cherish the company of my cat and dog, spending time playing with them and showering them with love.  \n\n**More Info**  \n• Possession of Type B driving license.  \n• Full availability.  \n• Proficient in social media handling.  \n• Open to work in any modality.  \n• Highly imaginative.  \n\n**Professional Experience**  \n2021-2021  \nQuality Assurance Tester  \nCloudRidge Digital | 100 Example Ave., Centro (Madrid)  \n• Video Game Testing – Nightfall Hymn (PlayStation 4): Conducted thorough testing to ensure the game met all required features and performance standards on PlayStation 4 and external platforms.  \n• Feature Compliance: Verified that the game adhered to PlayStation’s technical requirements and other necessary specifications.  \n• Bug Identification & Reporting: Systematically searched for and documented game errors, providing detailed reports for the development team.  \n• Regression Testing: Repeated specific gestures and input combinations in subsequent builds to confirm bug fixes and identify recurring issues.  \n\n**Academic Formation**  \nSep 2018 - Jun 2021  \nVocational Training in Higher Degree in 3D Animation, Games, and Interactive Environments  \nInstituto Atlántico de Diseño y Tecnología | Number of hours: 2060h  \nDiploma  \n\nOct 2022 - Aug 2023  \nMaster's Degree in 3D Modeling and VFX  \nTrazos Academy | Number of hours: 600h  Diploma  \n\n**Complementary Formation**  \nMarch 2024 - May 2024  \nOfficial Course on Game Design and Creation  \nEscuela Nacional de Innovación | Number of hours: 200h"
}
