{
  "link": "https://www.reddit.com/r/resumes/comments/1pbsgwv/9_yoe_graphic_designer_senior_graphic_designer_usa/",
  "title": "[9 YoE, Graphic Designer, Senior Graphic Designer, USA]",
  "text": "Thomas Verveck\n\nSENIOR GRAPHIC DESIGNER\n\nSenior Graphic Designer with 8+ years of experience in branding, packaging design, and client consultancy. SCAD M.A. in Advertising with expertise in design strategy and user-centered research. Proven ability to translate business needs into visually engaging solutions for Fortune 500 clients, healthcare organizations, and startups. Expert in Adobe Creative Suite, digital illustration, web design, and brand development across print and digital platforms.\n\nWORK EXPERIENCE\n\nPiedmont Harbor Health System                                                 01/2025 – Present\nGraphic Designer • Full-time\nDesigned branding and marketing materials for Piedmont Harbor Health System’s HIV and diabetes programs.\n• Created comprehensive branding schemes and logos for healthcare initiatives using Adobe Illustrator.\n• Built full-scale, user-friendly websites for nonprofit healthcare organizations using WordPress.\n• Designed promotional materials for medical conferences, including posters and digital presentations.\n• Produced social media graphics and online newsletters using Adobe Creative Suite.\n\nRidgeway Print & Graphics                                                     02/2022 – Present\nSenior Graphic Designer\nCreated graphic designs for a printing company serving a diverse clientele.\n• Led client meetings and managed ongoing communication throughout project lifecycles.\n• Executed graphic design projects across diverse industries, including corporate brands and local restaurants.\n• Designed product packaging for consumer goods and food/beverage clients.\n• Developed complete branding packages for startup clients.\n\nVerveck Studio Co.                                                            02/2017 – Present\nGraphic Designer\nRuns a design studio that helps companies create professional marketing materials.\n• Directed all aspects of branding projects for Fortune 500 clients.\n• Developed comprehensive marketing strategies and designed supporting collateral.\n• Created distinctive logos and complete brand identity systems.\n• Specializing in illustrations for marketing collateral for select clients such as Northlake Cola, Riverbend Spirits, Lantern Leaf Brewing, Millhouse Tacos, Heritage Deli Co., SkyWing Chicken, Stonebridge Hotel & Casino, and more.\n• Wrote brand-specific copy integrated with visual design for marketing campaigns.\n\nBright Avenue Murals                                                          08/2019 – Present\nMuralist & Founder\nCreated a LGBTQ+ mural business that helps brands tell their stories through large wall art.\n• Conducted high-stakes client consultations to understand branding objectives.\n• Managed complete project lifecycle, including concept development and budget planning.\n• Incorporated hand-drawn illustration techniques into mural designs.\n\nCedarbird Brandworks                                                          05/2021 – 05/2023\nGraphic Designer\n\nDesigns by Miko                                                               02/2021 – 12/2021\nGraphic Designer\n\nStudio Creative Works                                                         08/2018 – 12/2019\nGraphic Designer\n\nSKILLS\n\nProfessional\n• Branding\n• Client Pitching\n• Copywriting\n• Customer Problem-Solving\n• Project Management\n• Project Planning\n• Strategy\n• Team Leadership\n\nTechnical\n• Animation\n• Creative Direction\n• Graphic Design\n• Illustration\n• Print Production\n• Social Media Marketing\n• Typography\n• UI Design\n• Website Design\n\nSoftware\n• Adobe Suite\n• Autodesk\n• Figma\n• HTML\n• Microsoft Suite\n• Procreate\n• Sketch\n• Squarespace\n• WordPress\n\nEDUCATION\n\nMaster of Arts in Advertising\nSoutheastern College of Design • Harbor City\n\nBachelors of Arts in Graphic Design\nNorth Valley State University • Dahlonega"
}
