{
  "link": "https://www.reddit.com/r/resumes/comments/1jbg7ae/6_yoe_unemployed_graphic_design_united_states/",
  "title": "[6 YoE, Unemployed, Graphic Design, United States]",
  "text": "Morgan Stock\nExperienced Graphic Designer\n\nI am a goal-oriented and well-organized graphic designer with experience in packaging, print, and digital design. My skills lie in producing engaging and appealing content for companies and products alike. Though I work efficiently on my own, I thrive in a team-driven environment, and I am seeking a creative role with a like-minded company to further expand my experience!\n\nSKILLS\n\nBranding\n• Created and maintained brand standards via guidelines. Used these guidelines to create many assets for clients and companies including PowerPoints, Slides, case studies, white papers, and exhibition/tradeshow assets.\n\nAdobe Creative Suite\n• Highly proficient in Photoshop, Illustrator, InDesign, and Lightroom. Utilize these apps on a daily basis for graphic design, print layout, and photography.\n\nPrepress Design\n• Prepared digital files for print - including page layout, reformatting for different die-lines, proper layer and file names, and succinctly packaging files for the printers.\n\nPhotography\n• Highly skilled photographer of 10 years, with expertise in portraiture, product and event photography for companies.\n\nMarketing\n• Skilled in social media and B2B marketing with a license in Inbound Marketing via Hubspot Academy. Experience in copy writing and KPI analysis.\n\nWeb Design\n• Experienced in WordPress, Hubspot, CMS, and CSS.\n\nProject Management\n• Strong organization skills, with a talent for balancing high-volume workloads and cross-functional communication.\nUtilizes several different project management softwares including Monday, Trello, Slack, and Microsoft Office\ndepending on what clients and companies prefer.\n\nSoft Skills\n• Cross-functional Communication; Creative Thinking; Unique Problem-Solving Solutions, Quick Turnaround Time.\n\nCONTACT & PORTFOLIO\nOnline Portfolio: morganstock.design\nLinkedIn Profile: linkedin.com/in/morganstock\nEmail: morgan.stock@example.com\nPhone Number: (404) 555-0137\n\nEXPERIENCE\n\nGraphic Designer, Pine & Alloy Creative\nOctavia Street Studio\nOctober 2023 - October 2024\n• Designed print and digital assets for direct mail, B2B LinkedIn ads, and company branding. Skilled in cross-functional collaboration, managing high-volume projects with quick turnaround times, and supporting company culture through event planning and team-building.\n\nGraphic Designer, Peachtree Arts & Print Collective\nOctober 2022 - June 2023\n• Designed digital and print assets for local Atlanta non-profits and businesses, with expertise in print design, exhibition signage, and photography. Strong communication skills, adept in task management and file-sharing tools, and experienced in handling high-volume projects efficiently.\n\nContent Creator, Southline Social Studio\nJune - August, 2022\n• Created posts and copy for social media channels including Instagram and Twitter. Participated in styling, directing, and executing product photoshoots for photos and videos.\n\nGraphic Designer & Marketing Manager, Harborlight Packaging Co.\nSeptember 2019 - May 2022\n• Designed print and digital assets for social media and email marketing, packaging design, exhibition signage, and brand awareness. Skilled in product and event photography, WordPress website development, and delivering high-quality work under tight deadlines while maintaining strong cross-functional communication.\n\nEDUCATION\n\nBachelor of Arts\nMajor in Visual Arts\nConcentration in Photography,\nMinor in Marketing\nAtlanta College of Art & Design\n2014 - 2018"
}
