{
  "link": "https://www.reddit.com/r/resumes/comments/1p748ba/3_yoe_unemployed_graphic_designer_united_kingdom/",
  "title": "[3 YoE, Unemployed, Graphic Designer, United Kingdom]",
  "text": "Rahul Dennison\nLeeds,England ▪  Have the right to work in the UK\n\nCreative and results-driven professional with over three years of experience in graphic design, branding, and marketing communications. Holding an MSc in Marketing from Northbridge University and a BA in Graphic Design, I combine artistic creativity with analytical and strategic thinking to deliver impactful campaigns. My work bridges design and marketing, transforming insights and data into engaging, consumer-focused visuals that communicate with clarity and purpose. Passionate about storytelling, inclusion, and visual innovation, I craft designs that not only look beautiful but also build meaningful connections and deliver measurable results. Recognised for a strategic mindset, strong problem-solving skills, and meticulous attention to detail. Fluent in English and Spanish, with working knowledge of German and Italian, enabling effective collaboration in multicultural teams.\n\n## Competencies\nBranding & Visual Identity · Digital & Print Design · Motion Graphics · Storytelling & Narrative Design · Strategic Digital Marketing · Content Creation · Project Planning & Delivery · Social Media Management · Brand Engagement · Research & Evaluation · Analytical Reasoning · Reporting & Presenting · Cross-Team Collaboration · Client Relations · Critical & Creative Thinking · Attention to Detail · Organisation & Prioritisation\n\n## Technical Skills\nAdobe Creative Cloud · Adobe Lightroom · Adobe Photoshop · Adobe PremierePro · Adobe AfterEffects · Adobe InDesign · Adobe Illustrator · Figma · Canva · WordPress · Visual Studio Code · Microsoft Office (Excel, PowerPoint, Word, Teams) · Social Media · HTML(Basic) · Pantone Matching · Colour Proofing · Print Production & Finishing\n\n## Career Summary\n\nSocial Media Officer - Hartwell University                                                                 January 2025 - September 2025\nKEY ACHIEVEMENTS\n• Enhanced student engagement by approximately 50% through creative digital campaigns and inclusive communication initiatives.\n• Produced cohesive visual content and campaign materials that reinforced the Board’s mission to enrich the postgraduate experience.\n• Spearheaded the introduction of a new digital platform consolidating resources, events, and support networks for international students.\n\nRESPONSIBILITIES\n• Developed and coordinated marketing and social media campaigns following audience analysis and engagement data.\n• Created event visuals and communication assets aligned with the university’s identity guidelines.\n• Advocated for student needs during Board meetings, contributing to policy improvement.\n\nAudiovisual Designer Assistant - Luminex Studio • England                                                  January 2024 - July 2024\nKEY ACHIEVEMENTS\n• Led the brand transition and rebranding campaign, designing a complete visual identity system including colour palettes, typography, digital assets, print materials, and merchandising.\n• Produced over 20 motion graphics pieces (manuals, explainer videos, and animated content).\n• Directed the product relaunch campaign, overseeing photography, videos, and printed assets such as bus banners and promotional posters.\n• Earned formal commendation from the CEO for exceptional performance and creative leadership.\n• Leveraged data-driven findings to drive wide-scale areas of improvement within content creation, resulting in a notable increase in online engagement.\n• Honed an environment of transparency and collaboration among fellow marketers and graphic designers to promote creative and critical thinking practices.\n\nRESPONSIBILITIES\n• Accountable for all internal and external graphic and audiovisual design, from concept to delivery, such as animated manuals, produced videos, and printed pieces.\n• Collaborated with senior executives (VP, CEO) to present and implement creative strategies.\n• Maintained company social media platforms by distributing high-impact photo and video content based on weekly posting schedules. Captured and edited large amounts of images on a daily basis for future use.\n• Liaised with representatives from Digital and Trade Marketing, Product Design, HR, Sales, Account Management and Logistics teams to enable a free flow of ideas and mutual understanding.\n• Brainstormed data-driven ideas with other teams to help in team ideation.\n• Oversaw printing processes, conducted colour and quality checks, and managed suppliers.\n\nGraphic Designer - Freelance                                                                             November 2022 - December 2023\nKEY ACHIEVEMENTS\n• Delivered end-to-end design projects for multiple clients, including branding, social media campaigns, and editorial materials.\n• Recognised by clients for versatility, creativity, and meeting tight deadlines.\n• Supported businesses with visually consistent, audience-focused marketing materials.\n• Stayed updated on latest design techniques and best practices, as well as digital media trends, by engaging in constant research.\n\nRESPONSIBILITIES\n• Managed projects from brief to delivery, ensuring alignment with client goals and brand identity.\n• Produced creative assets for print and digital platforms.\n• Produced frequent progress updates to maintain client expectation, and organised meetings with customer representatives to gather distinct needs and requests prior to the delivery of tailored, innovative solutions.\n• Applied accessibility principles and storytelling to enhance engagement and inclusivity.\n\n## Education\n\nMSc Marketing - Northbridge University - England                                                          2024 - 2025\n• Recipient of “Northbridge Excellence Scholarship” and “Marketing Futures Scholarship”\n• Modules: Consumer Behaviour, Marketing Society and Insights, Markets and Strategy, Building Marketing Intelligence, and Marketing Communications\n\nBA Graphic Design (First Class Honours equivalent) - Ravenshire Institute of Design                        2017 - 2022\n• Participant in University’s Top Design Projects Exhibitions in 2018, 2019, 2020, 2021 and 2022\n• Modules: Branding & Visual Identity, Editorial & Print Design, Digital Media Design, UX/UI, Typography, Colour Theory, Photography, Advertising & Communication Strategy, Packaging Design and Inclusion & accessibility through art and design.\n\n## Professional Development\n• The Global Standard in Digital Marketing Certification, Digital Marketing Institute (Ongoing)\n• DIGITAL MARKSTRAT Business Simulation, Strata Simulations (2025)\n\n## Volunteer Work\n• SilverOak Community Centre (2022 – 2024) - Planned and supported community-focused events for a wide range of elderly residents by organising team members and promoting sustainable practices\n• BrightPath Learning (2023 – 2024) - Created interesting and dynamic English lesson plans for underprivileged children, fostering an inclusive environment for diverse social and cultural backgrounds\n\n## Portfolio and Projects\nLINK : Digital and print design · Illustration and editorial design · Email and social media graphics · Web banners and visual campaigns · Animation and video editing · Visual storytelling · Branding and identity projects · Fashion-inspired creative direction"
}
