{
  "link": "https://www.reddit.com/r/resumes/comments/1m3ng4j/0_yoe_llm_intern_machine_learning_engineer_india/",
  "title": "[0 YoE, LLM Intern, Machine Learning Engineer, India]",
  "text": "Aarav Mehta  \n+91-98765 43210 | aarav.mehta.in | LinkedIn | Github | Portfolio\n\nEDUCATION  \nSunridge Institute of Technology                                                                        Aug’23 - July’27  \nB.Tech in Computer Science Engineering  (8.33/10.0)  \nMinor in International Relations, Specialisation in Data Science\n\nEXPERIENCE  \nLLM Intern, Critical AI Pvt Ltd, Bengaluru                                                       July’25 - Current  \n• GenAI Audio & Image based narrative creation using Meta’s Llama-3.2-8B  \n- Integrated a multimodal GenAI system with RAG, Whisper STT, gTTs, image search, and OSM mappings.  \n- Business Impact: Improved functionality by over 50% of base provided console.  \n- Software tools: llama-cpp-python, faiss, PyMongo\n\nAI Intern, WESEE, Ministry of Defence, New Delhi                                                  May’25 - July’25  \n• Data Analysis and Report Generation Agent with MCP architecture  \n- Built a robust chatbot pipeline for processing real-time SQLite data, and generating reports for real-time usage.  \n- Business Impact: Reduced the workload of critical subject matter experts by more than 90%.  \n- Software tools: Langchain, SQLAlchemy, LangGraph, mcp-use, Ollama  \n\n• YOLOv8 Object Detection and Tracking with automated selenium web-scraped datasets  \n- Delivered object detection and tracking system, tuned on custom webscraped dataset, receiving over 75% accuracy.  \n- Business Impact: Improved reliability of real-time usage by more than 50%.  \n- Software tools: Ultralytics, Selenium\n\nPROJECTS  \nXLM-RoBERTa based Multi-Lingual sentiment analysis with auditory input support  \n• Developed pipeline that applies multi-modal analysis of audio input, with 5 supported languages scoring 70% accuracy.  \n• Utilises whisper for audio-to-text transcription, XLM-RoBERTa for textual sentiment analysis, AudioCNNs for auditory  \nsentiment analysis of MFCCs and an MLP model for data fusion.  \n• Technology Stack: PyTorch, scikit-learn, FastAPI, transformers\n\nGPT-2 Style LLM creation and Meta LLaMA-3.2 8B LoRA fine-tuning for Data Science workloads  \n• Built GPT-2 Architecture, replicating key components like MHA, and implementing KV-Cache for for 5x performance.  \n• Fine-tuned Meta LLaMA-3 8B employing PEFT training using LORA, and quantized it to Q5K-M as a GGUF.  \n• Technology Stack: PyTorch, TikToken, Unsloth, Transformers, PEFT, HuggingFace\n\nXGBoost based Churn Prediction with SHAP Analysis and powerBI dashboard  \n• Designed feature engineering, training and deployment pipeline for telecom churn: to understand why, and take action to  \nreduce it, with powerBI dashboard and streamlit frontend for intractability, and SHAP analysis with 70%+ scores.  \n• Includes data preprocessing, XGBoost training, Optuna hyperparameter tuning, and multiscoreed evaluation.  \n• Technology Stack: scikit-learn, shap, xgboost, optuna\n\nHybrid Anime Recommendation System with CI/CD pipeline and Kubernetes deployment  \n• Deployed pipeline to process data, train NCF model, and deploy on GKE, with over 73% reliability for recommendations.  \n• Used Jenkins for orchestrating CI/CD pipeline, tracked experiments with comet-ml, flask for API creation, and Google  \nCloud Registry for handling docker images, and DVC for data versioning.  \n• Technology Stack: comet-ml, flask, tensorflow, dvc\n\nTECHNICAL SKILLS AND CERTIFICATIONS  \nLanguages                              Python, C, C++, SQL  \nLibraries and Frameworks               Pandas, Numpy, PyTorch, scikit-learn, mlFlow, llama-cpp-python, Jenkins, kubernetes  \nCertifications                         MLOps with GCP - CI/CD & Kubernetes – KrishAI Technologies, 2025\n\nACHIEVEMENTS  \n- Dean’s list:  Monsoon’23  \n- Semifinalist speaker at SMVIT Parliamentary Debate’24 (Debating Society, Riverdale Tech University)"
}
