{
  "link": "https://www.reddit.com/r/resumes/comments/1hzxbqe/4_yoe_unemployed_machine_learning_engineer_usa/",
  "title": "[4 YoE, Unemployed, Machine Learning Engineer, USA - Getting constant rejections]",
  "text": "Avery Chen\n\nNo visa sponsorship required | +1 (555) 013-2749 | avery.chen.ml@gmail.com | LinkedIn | Publications\n\nSKILLS\n• Programming: Python, Java, SQL, Shell Scripting\n• Databases: MySQL, PostgreSQL, Oracle DB, Redis, Elasticsearch\n• ML Tools: PyTorch, TensorFlow, Pandas, NumPy, Seaborn, OpenCV, Jupyter, Flask, LangChain,\n  Tableau, Power BI\n• Cloud/DevOps: AWS, Airflow, Docker, Git/GitHub, CI/CD\n\nWORK EXPERIENCE\nAI-Focused Research Assistant: Redwood State University                                                       02/2022 – Present\n• Co-authored a cutting-edge AI research paper submitted to CVPR, addressing data exploitation risks in deep\n  learning with potential real-world impact, estimated to reach over 10,000 researchers and professionals.\n• Designed a novel defense method using PyTorch, and diffusion autoencoders to secure DL models against\n  data exploitation, processing 100,000+ data points to encode latent representations and obscure data\n  patterns effectively.\n• Achieved a 60% reduction in model vulnerability in accuracy, significantly enhancing security and resilience\n  against data extraction and reverse-engineering attacks such as adversarial training.\n\nMachine Learning Engineer (Data-focused): BluePeak Analytics                                             10/2020 – 12/2021\n• Maintained 99.9% uptime for Oracle SQL databases with 3M+ records through optimization and automated\n  backups using Python, DevOps, and Bash, reducing downtime impact by 30%\n• Implemented a distributed ETL pipeline using Apache Airflow and Python, optimizing data ingestion and\n  transformation processes to handle 1TB of daily data with 30% faster processing times.\n• Streamlined deployment with Jenkins and Docker, cutting time by 50% and downtime by 30%.\n\nMachine Learning Engineer: RetailPulse Inc.                                                            04/2019 – 09/2020\n• Built and led a 93%-accurate sentiment model (BERT based LLM, PyTorch) detecting rude retailers from\n  50,000+ interactions, reducing complaint calls by 50% and driving $20,000 in revenue.\n• Engineered a Python (selenium, beautifulsoup) web scraper to automate customer complaint collection from\n  10+ sources, reducing manual data efforts by 60% and improving insights on production errors.\n• Monitored production environments across 15+ Docker containers, ensuring 99.9% system reliability.\n\nJr. Machine Learning Engineer: Cedar Grove Tech                                                        12/2018 – 02/2019\n• Developed a churn analysis web application using Python Flask and SQL, identifying at-risk clients and\n  recovering 10% of potential churners, impacting 1,500+ accounts.\n• Conducted A/B testing on retention strategies, analyzing campaign effectiveness and recommending\n  adjustments that increased customer engagement rates by 12%\n\nSELECTED PROJECTS/PUBLICATIONS\n• Avery Chen, “Diffue: Towards more robust unlearnable examples\n  leveraging diffusion models”, CVPR, 2025 (Submitted).\n• Avery Chen, “Transfer learning based flat tire detection by using rgb images”, AIAME 2023.\n• Avery Chen, “Ideology detection using transformer-based machine learning models”, 2021.\n\nEDUCATION\nUniversity of Tennessee, Knoxville || Knoxville, TN\nM.Sc. Computer Engineering"
}
