{
  "link": "https://www.reddit.com/r/resumes/comments/1psozk1/3_yoe_recent_graduate_aiml_engineer_usa/",
  "title": "[3 YOE, Recent Graduate, AI/ML Engineer, USA]",
  "text": "Suparshwa Patil  \n+1 (555) 013-6427 | suparshwa.patil@mockmail.com | LinkedIn | GitHub | San Jose, CA\n\n## EXPERIENCE\n\nCivicRelay Labs                                                        June 2025 - Present  \n*Software Engineer - AI(Part-time)*                                        *Remote, California*  \n• Owned full lifecycle of an agentic RAG platform, from architecting core data retrieval infrastructure to deploying a multi-modal system that boosted volunteer productivity by 65% and cut onboarding time by 45%.  \n• Led evolution of an agent orchestration layer using Python (FastAPI), implementing intelligent routing that reduced p95 latency by 40% and optimized for cost and throughput under 10x user growth.  \n• Architected a type-safe frontend interface using TypeScript and React, implementing real-time streaming of agentic responses and optimizing state management for complex multi-modal RAG workflows.\n\nNexStep Calendar AI                                                     August 2025 - October 2025  \n*Founding Backend Engineer(Part-time)*                                     *Santa Clara, California*  \n• Designed and implemented base architecture from scratch, enabling rapid development and scalability of all product features.  \n• Built a core assistant using Agentic AI to automate follow-up workflows and scheduling, reducing manual effort for users by 40%.  \n• Applied Retrieval-Augmented Generation (RAG) with Agentic AI to deliver personalized content generation and contextual task assistance, improving user engagement and efficiency.\n\nFort Wayne ML Research Group                                            June 2024 - January 2025  \n*Graduate Researcher*                                                      *Fort Wayne, Indiana*  \n• Authored research on Dynamic Transformers, designing a novel method to dynamically adjust model architecture (T5, BART) during training, which reduced convergence time by 11% (from 6.5 to 5.8 hours) on machine translation tasks.  \n• Engineered end-to-end ML training pipelines on Purdue’s Gilberth GPU cluster, building high-performance environment from scratch to support large-scale model training, adversarial robustness testing (DistilBERT), and RAG chatbot development.\n\nAstraSoft Solutions                                                     January 2021 - June 2023  \n*Senior Software Engineer*                                                 *Pune, India*  \n• Created client-facing solution briefs to bridge technical development and business goals, improving alignment and contributing to 95% client satisfaction.  \n• Reduced API latency by 30% in a Java-based microservices architecture by analyzing slow query logs and optimizing complex SQL joins.  \n• Developed and maintained backend services for 10+ applications using Python and MySQL, achieving 99% uptime across production systems.\n\n## SKILLS\n\n**Languages**: Python (Proficient), Java, TypeScript, Go, SQL, HTML/CSS  \n**Machine Learning & LLMs**: PyTorch, TensorFlow, HuggingFace, LLMs, RAG pipelines, reinforcement learning (RL)  \n**Agentic AI / Frameworks**: LangChain, LangGraph, AutoGen  \n**Distributed Systems & MLOps**: Docker, GPU cluster optimization, quantization, CI/CD pipelines  \n**Databases & Cloud Services**: Relational (PostgreSQL, MySQL), Non-Relational (Redis, MongoDB), AWS Bedrock, GCP  \n**Certifications**: Oracle Cloud Infrastructure 2025 Generative AI Professional\n\n## EDUCATION\n\n**Master’s in Computer Science and Engineering (MS CS)**                    August 2023 - May 2025  \n*Purdue University*                                                         Fort Wayne, Indiana  \n*Relevant Coursework*: Operating Systems, Deep Learning (DL), Algorithms Design & Implementation, Natural  \nLanguage Processing (NLP)\n\n**Bachelor’s in Electrical & Electronics Engineering (BS EEE)**             July 2017 - June 2021  \n*SRM University*                                                            Chennai, India\n\n## PROJECTS\n\n**Contextual Emotion-Cause Detection** | Python, TensorFlow, RoBERTa, Logistic Regression | See here  \n• Engineered a hybrid NLP pipeline on the SemEval dataset (FRIENDS sitcom) to identify emotion-cause pairs, utilizing Logistic Regression with TF-IDF features to achieve 72% accuracy in emotion classification.  \n• Architected the cause extraction module as a Question-Answering (QA) task, leveraging a pre-trained RoBERTa model to query conversation logs based on predicted emotions, achieving 60% accuracy in causal span identification.\n\n**Adversarial Robustness & Gradient Optimization (Research)** | Python, TensorFlow, Computer Vision | See here  \n• Modernized the seminal ICML 2018 “Obfuscated Gradients” framework by migrating legacy code to TensorFlow 2.x, validating that standard randomization defenses collapse to 0% accuracy against adaptive Expectation over Transformation (EOT) attacks.  \n• Engineered a robust defense using Feature Distillation to minimize expected loss over stochastic inputs, achieving 97% accuracy on CIFAR-10 while maintaining semantic consistency under black-box perturbations."
}
