{
  "link": "https://www.reddit.com/r/resumes/comments/1on2lqn/0_yoe_unemployed_aimachine_learningsoftware_roles/",
  "title": "[0 YoE, Unemployed, AI/Machine Learning/Software roles, Melbourne]",
  "text": "Arjun Mehta\nMelbourne, VIC ❖ arjun.mehta.ai@gmail.com ❖ LinkedIn ❖ github.com/arjunmehta-ai\n\nSummary\nComputer Science graduate specializing in AI/ML, cloud infrastructure, and data engineering. Hands-on\nexperience in building end-to-end pipelines, optimizing system costs, and translating technical solutions into\nbusiness value. Seeking roles to apply problem-solving abilities across diverse technical challenges.\n\nEDUCATION\nBachelor of Computer Science                                                     Feb. 2022 – Nov. 2024\nMajor in Artificial Intelligence & Data Science\nRMIT University, Melbourne, VIC\nLeadership Achievement: Industry Experience Recognition\n\nTECHNICAL SKILLS\nLanguages & Libraries: Python (PyTorch, TensorFlow, Pandas, NumPy, Scikit-learn, Keras), SQL, JavaScript\nML/AI: Large Language Models, Fine-tuning (LoRA, QLoRA), Quantization, Generative AI, CNNs, LSTMs, Model\nEvaluation\nCloud & DevOps: GCP (Compute Engine, AWS, MLOps Pipelines, Microsoft Azure\nData Engineering: ETL Pipelines, Feature Engineering, Data Preprocessing, Time Series Forecasting, Clustering\nVisualization & Tools: Matplotlib, Seaborn, Excel, PowerBI, REST APIs\n\nCERTIFICATIONS\nAI-900 Microsoft Azure AI Fundamentals\n\nPROJECTS\nCalibrate and Fine-Tune Language Models to Reduce Model Hallucinations\n▪ Maintained hallucination rates within a 2-3% margin of error across quantization methods (4-bit and 8-bit),\n  cutting GPU expenses while preserving model reliability to make LLM deployment more economically viable.\n▪ Reduced inference costs by 80% through model quantization while preserving factual accuracy on HaluEval\n  benchmark.\n▪ Engineered end-to-end GCP pipeline for fine-tuning Llama-2-7B on both in and out of domain datasets using\n  LoRA/QLoRA to maintain accuracy.\n\n5G Network Performance Analysis and Prediction\n▪ Analyzed 10+ million network performance records using K-means clustering and LSTM models to forecast\n  bandwidth degradation patterns, helping prioritize maintenance for underperforming cell towers.\n▪ Built automated ETL pipeline to standardize and preprocess large-scale datasets, enabling time-series\n  analysis across multiple network parameters with shorter data preparation time.\n▪ Developed visualizations (Matplotlib, Seaborn) to communicate predictive insights to stakeholders,\n  translating technical findings into strategic network optimization recommendations.\n\nProactive Research Assistant Chrome Extension\n▪ Developed Chrome Extension that monitors academic browsing activity and proactively suggests relevant\n  research papers with relevancy scoring in real-time floating sidebar for researchers.\n▪ Implemented content scripts to detect research context from academic websites (arXiv, Google Scholar,\n  IEEE) and fetch contextually relevant papers via arXiv API integration.\n▪ Engineered background script architecture to bypass CORS restrictions, enabling seamless third-party API\n  calls without compromising browser security.\n▪ Integrated OpenAI API to perform deeper paper analysis and improve suggestion accuracy, reducing manual\n  literature discovery time for niche research topics.\n\nWORK EXPERIENCE\nGym Manager                                                                      June 2025 – Present\nNorthside Fitness, Melbourne, VIC\n▪ Analyze membership data and business metrics to optimize operations and inform strategic decision-\n  making.\n▪ Implement process improvements using data-driven insights to enhance operational efficiency and\n  customer satisfaction.\n▪ Manage coordination between operations and marketing.\n\nWaiter                                                                           May 2023 – June 2025\nLaneway Dining, Melbourne, VIC\n▪ Provide high quality customer service to over 300 customers a night, creating positive engagement to\n  boost restaurant reviews by 17%.\n▪ Worked collaboratively in a high-pressure environment, ensuring smooth operations through clear team\n  communication.\n\nADDITIONAL INTERESTS\nBasketball, Weightlifting, Content Creation, Hackathons"
}
