{
  "link": "https://www.reddit.com/r/resumes/comments/uf3jsp/resume_feedback_for_internships_and_entrylevel/",
  "title": "[0 YoE, Unemployed, AI/Machine Learning, USA]",
  "text": "alex.park@gmail.com ❖ (555) 013-7742 ❖ San Francisco, CA\nlinkedin.com/in/alex-park-ml\ngithub.com/alexpark\n\nSKILLS\n▪ Programming: Python, R, SQL, C++, MATLAB\n▪ Software: Git, Anaconda, Shell Scripting, RStudio, LaTeX\n▪ Key Skills: Statistical Modeling, Deep Learning (DL), Machine Learning (ML), Bayesian Inference, Bayesian Optimization, Supervised and\n  Unsupervised Learning Algorithms, Data Science (DS), Data Mining, Clustering and Feature Engineering, High Performance Computing (HPC).\n\nEDUCATION\nPhD in Applied Mathematics, GPA: 3.95, Redwood State University                                     Expected Jun. 2024\n▪ Research focus: Statistics, Machine Learning and Data Science, Gaussian Processes, Point Processes.\n▪ Relevant coursework: Probability, Statistics, Spatial Statistics, Time Series Analysis, Pattern Recognition, Mathematical Optimization.\n\nBSc in Mathematics, Major GPA: 3.95, Summa Cum Laude, Redwood State University                                      Jun. 2020\n▪ Relevant coursework: Data Science and Machine Learning, Probability, Advanced Linear Algebra, Stochastic Processes.\n\nWORK EXPERIENCE\nResearch Assistant, Redwood State University                                                      Aug. 2021 – Present\n▪ Achieved over 800% speed-up in statistical computation by developing custom Deep Convolution Neural Networks (DCNNs) to\n  regress parameters of covariance matrices of highly correlated spatial and temporal data modeled as Gaussian Processes using\n  Tensorflow/Keras/PyTorch.\n▪ Accomplished speed gains of up to 500% in training by implementing vectorized and parallelized algorithms to speed-up synthetic\n  spatiotemporal data generation and processing utilizing NumPy/SciPy, Joblib and Dask.\n▪ Gained over 1000% speed in training, evaluation and hyper-parameter tuning jobs on multiple machine learning algorithms by\n  deploying code on a distributed computing platform with multiple GPU support.\n▪ Reduced model error rate by over 10% by spearheading development of statistical models for spatial and time series analysis and\n  applied estimated parameters to interpolate missing data on validation/test set.\n▪ Communicated findings with experts and nonexperts and presented findings employing high-level data visualization tools including\n  Matplotlib, Seaborn, Plotly and ggplot2.\n▪ Lead development of a data transformation pipeline using Scikit-learn and pandas resulting in faster data processing and management\n  speeds and achieved standard best data management practices.\n▪ Improved model performance by experimenting with cutting-edge machine learning algorithms by attending weekly seminars on data-\n  driven modeling for computer vision (CV), natural language processing (NLP), and dimensionality reduction.\n\nHalf Research Assistant, Redwood State University                                                   Aug. 2020 – Jul. 2021\n▪ Secured 15% faster convergence rates by engineering optimization algorithms to solve high-dimensional problems.\n▪ Programmed numerical solvers for Partial Differential Equation (PDEs) leading to applications in medical imaging and computer\n  vision.\n▪ Reviewed literature in Bayesian and statistical inverse problems and presented weekly briefings to supervising professor.\n\nCapstone Research, Redwood State University                                                         Aug. 2019 – May 2020\n▪ Conducted research in Topological Data Analysis (TDA).\n▪ Accomplished deeper understanding of clustering and dimensionality reduction algorithms used in big data analysis and performed\n  algebraic feature extraction from simulated datasets with hundreds of redundancies.\n\nMEMBERSHIPS AND HONORS\n▪ Organizations: Society of Industrial and Applied Mathematics (SIAM), The Society of High-Performance Computing Professionals, Korean\n  International Statistics Society (KISS), Association for Women in Mathematics (AWM), American Mathematical Society (AMS).\n▪ Scholarships: Redwood State University Merit Scholarship for Outstanding Students.\n▪ Honors:"
}
