{
  "link": "https://www.reddit.com/r/resumes/comments/1q13wiw/3_yoe_unemployed_data_sciencemachine_learning/",
  "title": "[3 YoE, Unemployed, Data Science/Machine Learning Engineer, Hong Kong]",
  "text": "A machine learning engineer with 3 years of implementing data visualisation, applied machine learning, and analysis. Domain of expertise lies in educational finance, transport, and logistic companies shown in my job history.\n\nTECHNICAL SKILLS\n\nLanguages & Tools  \nProficient: Python and LaTeX.  \nExperienced: Java, SQL and Git.\n\nCommunication  \nFirst Language: English.  \nSecond Language: Cantonese (fluent speaker), Chinese (basic reading & writing).\n\nEDUCATION\n\nB.Sc in Applied Science (Statistics & Data Science)                                                                 SEP 2018  \nThe Hong Kong Polytechnic University SPEED  \n• Studied statistical learning and regression then implement them in Python and R.  \n• Studied probability & statistics, and using R for simulation.  \n• Developed a convolutional neural network to classify objects with Python and Keras with 80% accuracy.  \n• Studied relational database using T-SQL.\n\nA.Sc in Applied Science (Information Systems Development)                                                       JUL 2015  \nThe Community College of City University  \n• Studied Java programming and developed a simple image processor with feathuring, and noisy and wave filtering.  \n• Studied SQL and developed a simple movie database project.\n\nTECHNICAL EXPERIENCE\n\nMachine Learning Engineer / Deep Learning Project                                                              JAN 2025 — MAY 2025  \nForex Forest Limited.                                                                                                    Tsim Sha Tsui, Hong Kong  \n• Developed a forex trading predictor PyTorch with historical trends using LSTM of 80% accuracy.  \n• Optimised existing logistic regression trading bots using XGBoost by 35%.\n\nAnalyst Programmer / Transport Department Project                                                             OCT 2023 — Jan 2024  \nNEC Hong Kong Limited.                                                                                                  Hung Hom, Hong Kong  \n• Provided daily services for system report for camera system status using Python scripts.  \n• Monitored system’s camera status to report issues when arised throughout the day.\n\nProgrammer / Transport Department Project                                                                      AUG 2021 — FEB 2023  \nAutomated Systems(Hong Kong) Limited.                                                                                Sha Tin, Hong Kong  \n• Provided daily and weekly statistical reports using SQL.  \n• Analysed daily and weekly statistical results using R to streamline development process by 30%.  \n• Developed a Deep Learning image recognition system using PyTorch for iAmSmart.\n\nProgrammer / Gambling System Project                                                                            OCT 2020 — FEB 2021  \nVirtual Gaming Technology Limited.                                                                                       Tsim Sha Tsui, Hong Kong  \n• Developed a gambling environment system using Java based on client’s requirements.  \n• Provided statistical analysis and insight based on client’s gambling needs in Python.\n\nProgrammer / Terminal Management Platform Project                                                          MAY 2018 — JUL 2019  \nHutchison Ports Holdings Limited.                                                                                        Kwai Chung, Hong Kong  \n• Revamped the tollgate system to accomodate Swedish port’s requirements in Java and EJB.  \n• Maintained backend system to display and manage port and starboard’s navigation in Java and SQL.  \n• Codeveloped a suite of QA tools to help fulfil the Agile design for unit testing in Python.\n\nExpected salary:$ 28,000/month.  \nAvailability: Immediate."
}
