{
  "link": "https://www.reddit.com/r/resumes/comments/1j1rw91/25_yoe_sales_manager_sales_manager_united_states/",
  "title": "[25 YoE, Sales Manager, Sales Manager, United States]",
  "text": "CONNOR HART\nconnor.hart@example.com | (555) 014-7721 | linkedin.com/in/connorhart | Bayview, CA\n\nPROFESSIONAL SUMMARY  \n1am an ambitious sales manager with a track record of being a  \nproactive and goal-oriented professional who anticipates future  \nneeds and plans for success. By ensuring my pipeline is always 75%  \nfull to make certain quarterly goals are tracked and met.  \nKnown for my unique ability to use the right analogy/metaphor to  \nhelp negotiate and close deals. Understanding and pinpointing  \ncompanies’ complex problems gives me the capability to find the  \n“pain” and solution.  \nStrong focus on team collaboration and achieving results. Pursues  \nopportunities to learn new skills and contribute to group success.  \nOffers strong administrative, relationship-building and problem-  \nsolving abilities.  \n\nSKILLS  WORK HISTORY  \n* Self-Starter, being able to create and  - Sales Manager  \nadhere to self-constructed timetine  Harborview, CA_+ 04/2022 - Current  \n© New business development  * Sold, scheduled and managed over $1.5 mil in sales consistently  \nbuil and over the last 3 years by meeting and exceeded quarterly sales  \npe targets through diligent effort and persistence in closing end user  \n‘and B2B sales.  \n* Sales forecasting proficiency  * Overcame objections from new customers by addressing concems  \nEffective Verbal & Written  and offering customized solutions based on their needs.  \n. ee &  © Increased sales revenue by developing and implementing effective  \nComeunical  sales strategies and increased sales productivity by introducing &  \n* Exceptional at Multitasking  helping create our own CRM that helped streamline administrative  \nExhibit 4  tasks by 30%.  \n© e L  * Elevated brand visibility, coordinating with marketing to launch  \n* Resolution-oriented  successful promotional campaigns and organized and hosted  \nSales analysis  events to engage current members and attract prospective ones,  \n. Ga . gong A  boostihg overall pipeline generation.  \n. riendly (Salesforce,  \nZoHo, ete...)  e ated us  * $ Customer Success Manager - SaaS Sales  \n2 Lakehaven, CA» 04/2017 - 02/2022  \n* The prime focus was to work with the customer to define how an  \n\nEDUCATION  \nRiverstone Institute of Beauty  application, or set of applications, and all necessary supporting  \nMeadowridge, WA + 2004  technologies can be implemented to meet a set of high-level  \ncustomer requirements within our SaaS.  \n* Significant role in creating our SaaS. Helped test and analyzed the  \nLicense: Cosmetology  UL. I played an intricate role in development on our in-house  \nSt. Augustine Academy  inventory system, remote help station, MDM, location manager  \nCedar Glen, WA + 2001  and cellular data manager.  \nDemonstrated success selling and building 82B relationships for a  \nHigh School Diploma  SaaS solution from the ground up with key roles in creating quota  \n| |  driven goals.  \n* Created creative strategies to guarantee solutions for customers  \nwithin our SaaS. Established performance goals for employees and  \nprovided feedback on methods for reaching those sales  \n\nmilestones.  \n\n© Established strong relationships with key customers, resulting in  \nincreased customer loyalty by Assisting customers with onboarding  \nand product setup to foster successful adoption and usage and  \nconducted regular account reviews to assess progress and  \nstrategize future growth opportunities for new and loyal clients.  \n\n- Membership Sales Coordinator  \n\nMapleport, OR_ + 01/2016 - 02/2017  \n\n* Single-handedly maintained accurate records of memberships,  \nensuring timely renewal reminders were sent to prevent lapses in  \nsubscriptions consisting of 275k plus members.  \n\n¢ Increased new member sign-ups by 10% with the help of using data  \nanalysis and designing compelling marketing materials and  \npromoting membership benefits in various channels.  \n\n© Organized and hosted events to engage current members and  \nattract prospective ones, boosting overall participation rates.  \n\n* Managed and processed all membership and payment data into our  \nself-created software.  \n\n© Provide executive-level administrative support to the software  \ndeveloper with weekly Ul meetings to make it easier to use, more  \nintuitive, and more visually pleasing resulting in 20% less  \nadministrative duties for the entire team.  \n\nC - Sales Manager  \n\nNorth Harbor, OR_ = 02/2013 - 01/2016  \n\n* Startup company. First year sales totaled $300k, with 30% yearly  \nincrease.  \n\n© Increased sales revenue by developing and implementing effective  \nsales strategies that resulted in delivering high-quality projects on  \ntime and within budget.  \n\n* Develop project plans, including timelines, milestones, blueprints,  \nresource allocation and management of up to 16 employees  \n\n¢ Negotiated contracts with vendors and suppliers, ensuring the best  \npricing and terms for company profitability.  \n\n* Maintained accurate financial records by reconciling accounts  \npayable/receivable transactions regularly to ensure balanced  \nbudgets.  \n\nAtlas Mobile (Sprint) - B2B Sales Executive  \n\nMapleport/Coastline, OR + 12/2008 - 02/2013  \n\n© Self-formulated daily and weekly sales goal and targets of 30 to 50  \ncold calls daily for new business with a 1:20 ratio of success and  \nScheduled 7 to 10 appointments weekly and went on outside  \nappointments for sales/service with a close rate of 1:15, totaling  \n$500k in upfront sales and 3% commission on all contracts  \nobtained.  \n\n* Leveraged CRM tools effectively manage pipeline efficiently while  \nmaintaining up-to-date records of interactions and deals.  \n\n* Develop and conduct training for all general and technical topics  \nwith In-depth knowledge of new and latest platforms, revision and  \nhardware. Including loT and SaaS solutions."
}
