{
  "link": "https://www.reddit.com/r/resumes/comments/1fnrpvp/7_yoe_sales_ops_sales_or_revenue_ops_united_states/",
  "title": "[7 YoE, Sales Ops, Sales or Revenue Ops, United States]",
  "text": "Jordan K. Avery\nSales Operations Manager | Revenue Operations Expert | Sales Enablement\n(555) 013-8274 | jordan.avery@example.com | Denver, CO\n\nSUMMARY\n7+ years of experience in sales/revenue operations management. I have a proven record of optimizing sales workflows, creating accurate reporting systems, and improving sales team efficiency. Deep knowledge and expertise with automation, training, enablement, reporting, forecasting, and CRM/Salesforce administration.\n\nSKILLS\nSalesforce Administration • Sales Analytics • Sales Enablement • Process Improvement • Data Integration • Revenue Forecasting • Cross-Functional Teams • Product Management • Workflow Automation • Pipeline Development\n\nEXPERIENCE\n\nSUMMIT INDUSTRIAL SYSTEMS\nGlobal Sales Operations Manager                                              December 2022 – Current\n• Rebuilt and optimized Salesforce workflow based on user and leadership feedback, reducing data entry requirements by 50%.\n• Implemented data integration between Salesforce and other business tools including Oracle ERP, Hubspot and Microsoft SQL Server, improving efficiency by 70% and standardizing data throughout the product lifecycle.\n• Partnered with leadership and stakeholders across engineering, sales, legal, and finance to improve and streamline lead-to-cash process; resulting in a 30% decrease in help requests between departments.\n• Provided ongoing training, updates, support and guidance to global sales and engineering team of 100+ users. Increased Salesforce adoption by 50% in a 6-month period.\n• Lead and managed recurring Deal Desk, Quarterly Business Review, and Monthly Pipeline Strategy meetings. Developed comprehensive, detailed sales pipeline forecasts and reporting process using Salesforce, PowerBI, Excel, and SQL. Provided CEO/executive team with accurate reporting and improved pipeline accuracy by 60% in 9 months.\n• Built and lead a team of 3 Revenue Operations specialists across Europe, Asia, and the US to provide real-time support to offices and operations across the globe.\n\nHARBORSTAY TECH\nCustomer Success + Sales Enablement Manager                                  December 2021 – December 2022\n• Designed and implemented Salesforce flows for automated, personalized customer onboarding e-mail and SMS follow-up across four regions and three languages, saving each team member over 10 hours per week.\n• Created real-time data integration using Workato to synchronize data between Salesforce, Calend.ly, Zendesk, and Turo’s internal database, providing sales reps with accurate analytics on over ten million cars, trips, and drivers.\n• Built over 150 reports and dashboards using Salesforce and Tableau to support seven distinct sales teams across four regions; providing clear insights into KPIs including retention rate, trips per customer, and revenue by vehicle.\n• Provided a team of 75+ users with monthly training, updates, and documentation. Helped sales leadership scale and onboard team on journey from 25 reps to 60 reps over a 1-year period.\n• Built and lead a team of 2 Salesforce specialists to provide detailed guidance and support to international sales teams.\n\nCOBALT RIDGE CONSULTING\nSales Operations Manager                                                     June 2021 – December 2021\n• Selected and implemented Outreach.io sales enablement platform; increasing contacts reached per week by 50%, improving e-mail open and click-through rates by 20%, and growing sales pipeline by 10% in 5 months.\n• Gathered requirements and executed targeted ABM campaign alongside executive team and sales leadership, resulting in 7 new Opportunities and $20M in sales pipeline created over a 3-month period.\n• Created data hygiene and reporting processes for Salesforce; resulting in the removal of 2,000+ duplicate or inaccurate records across Accounts, Contacts, Leads and Opportunities.\n\nCOBALT RIDGE CONSULTING\nSr. Sales and Marketing Analyst                                              September 2019 – May 2021\n• Selected and implemented ActiveCampaign to replace legacy marketing automation platform, resulting in a 20% increase in engagement over 6 months while reducing costs and administrative resources by over 50%.\n• Collaborated with marketing, sales, and engineering leaders to create detailed whitepapers, videos, and other assets for ongoing account-based marketing and marketing automation campaigns.\n• Revised digital marketing strategy to reach and engage senior decision makers at Fortune 2000 firms, creating a 20% increase in sales pipeline while reducing advertising spend by 30% over a 3-month period.\n• Implemented LinkedIn Sales Navigator and managed ongoing training, reporting, and integration to Salesforce; resulting in 25% increase in contact data accuracy and 30% increase in contact/lead creation over 12 months.\n\nCOBALT RIDGE CONSULTING\nProduct Sales + Marketing Specialist                                         December 2016 – June 2019\n• Managed all sales and marketing operations activities including trade shows, content marketing, and digital marketing for startup SaaS field service management product.\n• Implemented and maintained Pipedrive and Hubspot for customer data, provided additional support for business systems including Zendesk, JIRA, Zapier, and Pendo.\n\nNORTHLINE DIGITAL STUDIO\nDigital Marketing Consultant                                                 September 2014 – September 2016\n\nEDUCATION\n\nMaster of Business Administration (MBA)                                      July 2026 (In Progress)\nGREAT LAKES UNIVERSITY\nSpecialization in Business Analytics + Operations.\n\nBachelor of Science (BS) – Applied Economics                                 May 2013 (Completed)\nGREAT LAKES UNIVERSITY\nSpecialization in Resource Management"
}
