{
  "link": "https://www.reddit.com/r/resumes/comments/1nynhzw/15_yoe_unemployed_sales_usa/",
  "title": "[15 YoE, Unemployed, Sales, USA]",
  "text": "Jordan Taylor  \n(555) 013-7842 | jordan.taylor@email.example | Raleigh, NC | linkedin.com/in/jordantaylor  \n\nExperienced in sales, property management, customer service, and operations coordination across healthcare, real  \nestate, and corporate environments. Skilled in client acquisition, negotiation, communication, and relationship  \nmanagement. Adept at identifying customer needs, presenting solutions, and closing deals. Seeking to apply my  \ncustomer service and negotiation skills in a dynamic sales environment.  \n\nSkills  \nTechnical: Microsoft Office Suite, Google Docs, Canva, Basic Graphic Design, Zoom, Slack  \n\nSales and Client Relations: Customer Service, Contract Negotiation, Marketing Strategies, Market Research  \n\nOperations and Administration: Office Coordination, Scheduling, Calendar Management, Data Entry, Records  \nManagement, Budgeting  \n\nSoft Skills: Collaboration, Teamwork, Problem-Solving, Time Management, Adaptability  \n\nExperience  \nProperty Manager  \nPinecrest Residential Management                                                                 Nov 2022 - Jun 2025  \n• Managed day-to-day administrative operations, including scheduling, budgeting, and record-keeping.  \n• Maintained an average 95% occupancy rate through targeted marketing, property showings, and consistent  \n  follow-up.  \n• Handled client communications, contracts, and financial transactions, delivering efficient, reliable, and  \n  client-focused service.  \n• Negotiated lease terms and pricing, increasing lease renewals by 20% through relationship building.  \n• Researched local market trends to adjust pricing strategies.  \n• Promoted property upgrades and add-ons, improving tenant satisfaction and overall revenue.  \n\nQuality Assurance Tester  \nBluePeak Digital                                                                          Aug 2019 - Feb 2020  \n• Tested company website for functionality, regression, responsiveness, accessibility, and performance across  \n  multiple Apple devices and locales.  \n• Worked in an Agile environment and participated in all SCRUM meetings including daily stand-ups, sprint  \n  planning, grooming sessions, and retrospectives.  \n• Collaborated with developers to identify, prioritize and resolve bugs effectively.  \n\nAdministrative Associate  \nGreenway Family Medicine                                                                    Jan 2017 - Jul 2017  \n• Scheduled and registered an average of 50+ patient appointments daily.  \n• Managed data entry, insurance verification, and medical billing using EPIC software.  \n• Processed patient payments, check-ins, and check-outs efficiently.  \n• Assisted physicians and staff with medical records management and coordination.  \n\nAdministrative Associate  \nLakeside Medical Group                                                                     Dec 2010 - Jan 2017  \n• Streamlined the patient check-in process, reducing average wait times by 10 minutes.  \n• Facilitated communication between patients, physicians, and pharmacies, ensuring accurate prescription  \n  processing.  \n• Maintained confidential medical and financial records in compliance with HIPAA regulations.  \n• Entered and updated patient data in EHR Systems (Practice Fusion and Allscripts).  \n• Managed general office troubleshooting and workflow improvements.  \n\nEducation  \nBS, Biological Sciences  \nNorth Carolina State University - Graduated 2015"
}
