{
  "link": "https://www.reddit.com/r/resumes/comments/1mnd7ju/6_yoe_sales_director_target_role_sales/",
  "title": "[6 YoE, Sales Director, Target Role - Sales Director/client partner, USA]",
  "text": "Daphne Hart\nAtlanta, GA | (555) 014-7721 | daphne.hart@email.com | linkedin.com/in/daphne-hart\n\nPROFESSIONAL SUMMARY\nDynamic retail sales and operations leader with an MBA and experience in multi-unit retail management, driving sales growth, operational efficiency, and team development. Successfully transformed underperforming markets into top performers, achieving up to 200% voice close rate increases and 100% quarter-over-quarter revenue growth. Skilled in leading high-performance teams across multiple locations, managing profit and loss (P&L), exceeding sales targets, and spearheading full-cycle recruiting to build top-tier teams across 7 states. Expertise in key account management for SLED, enterprise, and government sectors, with a focus on enhancing customer satisfaction and profitability. Proven ability to implement strategic initiatives, mentor leaders, and launch scalable programs to drive business success.\n\nPROFESSIONAL EXPERIENCE\n\nDirector of Retail and Business Sales and Operations                                                                 09/2023 — Present\nResponsible for operations and strategic initiatives, sales goals, personnel management, and day-to-day operations of 80+ ApexTel retail locations and 4 business sellers.\n• Drove strategic initiatives, sales performance, personnel management, and daily operations for 90 ApexTel retail locations which resulted in immediate revenue growth (100% growth quarter over quarter)\n• Manager regional profit and loss statements ensuring financial accuracy and alignment with organizational goals.\n• Oversaw regional budget development and compliance, holding 12 district managers accountable for budget adherence\n• Led market strategies in reputation management, market penetration, revenue growth, and operational efficiency to meet business objectives.\n• Directed recruitment operations across 7 states, streamlining hiring processes for retail and sales roles.\n• Supervised a team of 12 area leaders, 80 store managers, 250+ sales representatives, and 4 SMB representatives, fostering high-performance culture.\n• Managed key accounts in SLED, Higher Education, and Enterprise sectors, strengthening client relationships and driving sales.\n• Implemented team-building and motivational programs to promote accountability and operational excellence.\n• Mentored 6 store managers for successful promotion to area leader roles through targeted development plans.\n• Built and maintained industry relationships to support strategic partnerships and business development.\n• Launched leadership development programs, resulting in promotions for store leaders, assistant managers, and sales representatives.\n• Led regional operations teams to reduce shrink and cut operational losses by 50% through process improvements.\n• Collaborated with external affairs, legal, and marketing teams to align regional strategies with corporate objectives.\n\nArea Sales Leader — BluePeak Wireless                                                                                 04/2021-09/2023\nResponsible for strategic initiatives, sales goals, personnel management, and day-to-day operations of 13 BluePeak Wireless retail locations and business sellers\n• Led strategic initiatives, sales performance, personnel management, and daily operations across 13 retail locations in Mid-Atlantic markets\n• Transformed a last place market by increasing key revenue metrics by 200% and reducing fraud incidents through targeted process improvements\n• Implemented team building and motivational programs to foster accountability and drive operational excellence.\n• Mentored 10+ sales representatives for promotion to assistant manager and assistant managers for promotion to store manager roles through structured development plans\n• Launched and scaled several pilot programs that progressed to successful national roll outs.\n\nEDUCATION\n\nSoutheastern Coast University\nMaster of Business Administration"
}
