{
  "link": "https://www.reddit.com/r/resumes/comments/1mbrww7/20_yoe_unemployed_sales_representative_or_sales/",
  "title": "[20 YoE, Unemployed, Sales Representative or Sales Manager, United States]",
  "text": "Luba Morson\n\nSalt Lake City, Utah | 555-555-5555 | luba.morson@outlook.com | https://www.linkedin.com/in/luba-morson/\n\nSales Professional\n\nAccomplished B2B Sales Leader possessing a documented track record of sucessfully selling medical equipment and supplies\nacross the healthcare continuum, Proficient selling enterprise technology, including Al-powered SaaS platforms for\nconversational automation, workflow optimization, and customer experience enhancement. Proven competence in strategic\nselling, account management, and complex contract negotiation. Known for exceeding quotas, growing revenue, and building\nlong-term client relationships. Trusted advisor skilled in aligning solutions to customer KPIs and guiding stakeholders through\ncomplex sales cycles.\n\nAwards and Recognition\n\ne Annual Quota Achiever — Verity Conversational AI, Inc. 2021-2024 | Exceeded quota across Enterprise Al SaaS portfolio.\n\ne Strategic & Digital Accounts Lead — Verity Conversational AI, Inc. 2022 | Led digital transformation initiatives for top-tier clients.\n\ne Sales Innovator — Summit Medical Industries 2013 | Created an e-contract process that accelerated time to close by 300%.\n\ne Corporate Sales Rep of the Year — Summit Medical Industries Corporate Accounts Division 2013 | Top national performer for\nadoption and revenue growth.\n\ne Annual Quota Achiever — Summit Medical Industries 2008—2012, 2014—2019 | Consistently surpassed annual revenue goals.\n\ne Leadership Promotions — Recognized for sales performance and talents through progressive leadership promotions:\nSales Rep, Sales Trainer, Regional Manager, Market Sales Director, Critical Accounts CSM, and Management Graduate.\n\nExperience\n\nAurora Outdoor Lighting Co.\nOwner | Salt Lake City, Utah Jun 2024 — Present\n\nLaunched and successfully operate an entrepreneurial venture specializing in professional design, installation, and maintenance\nof permanent and seasonal outdoor LED lighting. Rapidly identified an underserved market: homeowners needing expert\ninstallation of retail lighting products and quickly established a profitable local business.\n\ne Developed and executed sales and marketing strategies, driving consistent startup revenue.\n\ne Implemented targeted local marketing campaigns via social media, online ads, and referrals to maximizing bookings.\n\ne Manage end-to-end operations, including sales, marketing, quoting, installations, project management, and invoicing.\n\nVerity Conversational AI, Inc.\nCustomer Success Manager | Palo Alto, CA (Remote) Aug 2021 — May 2024\n\nTransitioned from a successful medical sales and sales management career to embrace a strategic opportunity and gain sales\nexperience in Al driven SaaS, enterprise solutions. Recruited by Executive leadership to bridge a critical gap between Sales and\nCustomer Success, ensuring seamless post-sale handoffs, improve client retention, and drive revenue expansion. Committee\nChair tasked to develop and implement scalable workflows via Gainsight CRM. Reduced labor intensive CSM activities by\nmore than 90% through automation. Role concluded following company-wide reorganization due to funding constraints.\n\ne Proactively drove revenue expansion by identifying sales opportunities within existing accounts, consistently surpassing\nquarterly and annual targets by 110%.\n\ne Promoted to Critical Accounts Escalation Manager, managing high-value accounts and leading cross-functional initiatives\nto retain key customers, protect margins, and streamline executive communications.\n\ne Led enterprise-wide digital customer success strategy leveraging Gainsight to build automated journey maps,\nsegmentation, A/B test campaigns, and proactive churn mitigation for 1,000 + customer base.\n\ne Recognized as a Top Performer in Global Customer Success and the first graduate of the company's Management\nDevelopment Program, leading a team of four CSMs to attain sales goals and quotas.\n\ne Designed and implemented scalable Customer Success processes, including CRM automation, new hire training, and\nonboarding programs, improving efficiency and account management.\n\nMedical Company Name\nMarket Sales Director | Salt Lake City, UT Jan 2015 — Jul 2021\n\nDirected Northwest Health Group Homecare, Hospice, and Managed Care sales across an 11-state Pacific Northwest region, driving\nmultimillion-dollar growth and fostering executive-level relationships. Conducted strategic business reviews with C-Suite\nexecutive teams, clinical leadership and inventory management to uncover additional revenue generating opportunities.\nSpearheaded sales strategies that consistently exceeded revenue and gross margin goals while optimizing team performance by\nleading continual sales training and accountability initiatives.\n\ne Grew regional sales from $10.5M to $27M (2016-2020), maintaining 15.23% average gross margin—more than double the\nPost-Acute division average.\n\ne Secured the region's largest Acute Care target, generating $2.3M in new gross margin by employing exceptional sales skills.\n\ne Achieved maximum possible sales growth within the Homecare Division, leading the organization in gross margin\nperformance 2019—2020.\n\ne Led high-impact sales initiatives including quota setting, rep training, and performance accountability programs to\noptimize team output and regional profitability.\n\nRegional Manager | Salt Lake City, UT Jan 2012 — Dec 2014\n\nManaged a team of 10 sales representatives across the Pacific Northwest, while directly overseeing my own territory. Created\ntwo new expansion territories, hired and onboarded sales representatives and implemented strategies to drive regional sales\ngrowth. Conducted field rides, weekly sales progress meetings, and pipeline management to ensure sales quotas were met.\n\ne Directed regional sales team to 128% of assigned quota, while onboarding and coaching two new representatives.\n\ne Implemented focused customer retention activities resulting in less than 8% churn, equating to 120% customer\ngrowth.\n\ne Retained sales team through a personalized management approach, empowering reps to meet customer-specific needs\nmore effectively freeing them to focus on activities that drove their quota attainment.\n\ne Promoted to “Train the Trainer,” an advanced leadership role mentoring new managers to elevate team performance.\n\nSales Representative | Salt Lake City, UT Aug 2008 — Dec 2011\n\nServed as Sales Representative for Northern Utah, selling disposable medical supplies and capital equipment to all businesses\nwithin the post-acute industry. Recognized for exceptional customer retention and winning new business by utilizing strong\nsales skills and leveraging available resources. Attained consistent growth and leadership promotions by relentlessly seeking to\nbe an expert in the Post Acute industry, creating lifelong customers and becoming a resourceful innovator within Summit Medical Industries.\n\ne Expanded active account base from 80 declining accounts to 157 growing accounts within two years.\n\ne Grew annual recurring sales from $1.3M to $4.5M, exceeding quota in five out of six years.\n\ne Achieved #1 ranking among U.S. sales representatives for annual promotional sales in 2011.\n\ne Awarded “Best of the West” in 2012 for securing highest payout in quarterly promotional sales.\n\ne Inducted into the Elite $4M sales club for exceptional quota attainment.\n\ne Earned promotions to Sales Trainer in (2009), Regional Manager (2012) and RVP of Homecare (2015).\n\nEducation\n\nBachelor of Arts (B.A.), Technical Sales\nCanyon Ridge University, Ogden, UT\n\nSkills\n\nSPIN Selling | Challenger Sales | Customer Profiling | Contract Negotiation | Customer Retention & Satisfaction\nGainsight | Salesforce | CRM Automation | Journey Mapping | New Product Launch & Adoption | Presentation Expert\nMS Excel Advanced User | Market Analysis & Growth Strategies | Cross-functional Team Leadership | Closer\n\nCore Competencies\n\nSales Strategy & Execution | Executive HCP Relationship Management | Consultative & Solution Selling\nStrategic Negotiation | Quota Achievement | Strategic Account Planning | Closing New Business\nRevenue Growth & Forecasting | Dynamic Presentations | CRM & Data-Driven Sales | Data Analytics"
}
