{
  "brief_interpretation": {
    "low": "Begins designing without producing a written articulation of the objective, audience, constraints, and success criteria. Treats the brief as a list of deliverables rather than as criteria for what the design must accomplish. Does not identify open questions or ambiguities up front, and proceeds without confirming requirements such as format, usage context, accessibility needs, or brand constraints.",
    "medium": "Summarizes the objective, audience, constraints, and deliverables in a workable design intent statement and identifies key open questions. Produces an initial plan for exploration (e.g., concepts, references, content needs) and aligns basic choices (format, dimensions, platform constraints) to the intended use. However, the intent statement is not consistently translated into explicit evaluation criteria for tradeoffs across iterations (e.g., readability vs. expressiveness, brand fit vs. novelty).",
    "high": "Produces a concise design intent statement that links objective, audience, context of use, constraints, and success criteria, and uses it to guide decisions throughout the process. Identifies ambiguities early and resolves them via specific questions or written assumptions. Defines evaluation criteria that make tradeoffs explicit (e.g., hierarchy, comprehension, brand fit, accessibility) and updates the intent as requirements change without losing coherence."
  },
  "visual_hierarchy": {
    "low": "Layouts do not specify a clear focal point and reading order; multiple elements use similar emphasis and compete for attention. Hierarchy relies on inconsistent sizing/weighting, leading to unclear prioritization of information. Spacing and alignment vary without a stated grid or structure, and similar content is not grouped consistently.",
    "medium": "Establishes a primary focal point and a generally readable information order using size, weight, spacing, and grouping. Uses a grid or consistent alignment in most areas and can adjust hierarchy in response to content priorities. However, hierarchy is not consistently preserved under variations (dense copy, small formats, multiple calls-to-action) because rules for emphasis and grouping are not applied consistently.",
    "high": "Creates a consistent hierarchy that supports the intended reading path and decision (e.g., understand, choose, click) across common variations. Uses grid, alignment, spacing, and typographic scale systematically to control emphasis and scanning behavior. Can explain and adjust hierarchy via specific levers (contrast, proximity, scale, repetition) while maintaining coherence across breakpoints and placements."
  },
  "typography": {
    "low": "Type choices and settings reduce readability: inconsistent styles, insufficient contrast, line lengths that are poorly matched to the format, and weak spacing control (tracking/leading). The type system is ad hoc (many near-duplicate styles), and text styles are not reused consistently across assets.",
    "medium": "Uses legible type choices and a basic type system (e.g., headings, body, captions) with mostly consistent spacing and contrast. Applies typographic conventions (alignment, line length, leading) in typical cases and can refine issues when identified. However, the system does not consistently scale across formats or languages, and edge cases (long strings, localization, small sizes) are not routinely handled via explicit rules or fallbacks.",
    "high": "Builds a reusable type system with defined styles, scale, and spacing rules that preserve readability across formats and content variability. Controls typographic details (leading, tracking, line length, optical alignment, contrast) to support hierarchy and tone. Prepares typography for real constraints (localization, long names, accessibility sizing, rendering differences) using explicit rules and fallbacks."
  },
  "composition": {
    "low": "Compositions lack consistent spacing rules (margins, gutters, and alignment), and element scale relationships vary without a defined structure. Grouping cues (proximity, alignment, containment, contrast) are applied inconsistently, so related elements are not reliably perceived as a unit. Repetition and rhythm are inconsistent across a set of assets, and layout patterns are not reused predictably.",
    "medium": "Produces balanced compositions with mostly consistent margins, spacing, and grouping, and uses repetition to create some cohesion across a set. Integrates imagery and color with layout in typical cases. However, composition quality varies across variants because spacing rules, scale relationships, and alignment patterns are not consistently maintained when content or format changes.",
    "high": "Creates compositions with explicit structure: consistent margins, rhythm, balance, and intentional negative space that support hierarchy and tone. Integrates color, imagery, and layout as a single system (e.g., consistent scale relationships, alignment cues, and repetition). Maintains cohesion across a family of assets through defined composition rules that remain stable under variants and content changes."
  },
  "brand_alignment": {
    "low": "Design choices do not follow stated brand attributes or guidelines; tone and visual language vary across assets. Colors, typography, logo usage, iconography, and imagery treatments are applied inconsistently, and decisions needed for future reuse are not documented. Brand constraints are not used as decision criteria when selecting styles and visual treatments.",
    "medium": "Applies core brand elements (palette, typography, logo usage, imagery style) with basic consistency and can reference guidelines when making choices. Produces assets that generally match the brand, though details drift across variants (e.g., spacing around marks, color application, illustration/photo treatment). Documentation of brand-specific decisions is partial or not standardized.",
    "high": "Translates brand attributes and guidelines into consistent, repeatable rules for type, color, imagery, iconography, and layout, and applies them across asset families. When guidelines are incomplete, defines and records extensions (e.g., additional type scale, spacing rules, component treatments) that preserve brand voice. Produces handoff-ready specs that make brand-consistent reproduction and variation straightforward."
  },
  "production_readiness": {
    "low": "Files are difficult to use or modify: inconsistent naming, missing linked assets, unstructured layers, and non-reusable components. Exports do not reliably match required specs (sizes, formats, safe areas, bleed) or include avoidable technical issues (e.g., low-resolution rasterization, incorrect color profiles, insufficient contrast for intended use). Versioning and source-of-truth are not specified.",
    "medium": "Delivers organized files with mostly consistent layer structure, naming, and exports that meet common specs. Uses components/styles in some places and can prepare basic handoff notes. However, reuse and scaling are limited because components, tokens, and export settings are not consistently systematized across the full set of assets.",
    "high": "Delivers production-ready files with clean structure (naming, grouping, components, styles/tokens) and exports that reliably match spec across sizes, formats, and platforms. Uses reusable components and constraints to support rapid iteration and variant generation. Provides clear handoff documentation (source-of-truth, export settings, usage notes, accessibility/contrast checks, and versioning) sufficient for others to maintain and extend the work."
  },
  "iteration_process": {
    "low": "Iterates by making broad stylistic changes without stating what requirement or criterion the change is intended to improve. Alternatives are not structured (e.g., changes mix multiple variables at once), and feedback is applied inconsistently across variants. Does not maintain decision notes that link revisions to criteria, making it difficult to explain why a final direction was chosen.",
    "medium": "Generates multiple concepts or variants and can explain key differences and tradeoffs. Incorporates feedback into revisions and keeps versions organized. However, iteration is not consistently hypothesis-driven: changes are sometimes made without explicit evaluation criteria, and learnings are not reliably captured as reusable rules for the system.",
    "high": "Runs a hypothesis-driven iteration loop: states what the design must improve (e.g., comprehension speed, clarity of call-to-action, brand tone), tests targeted changes while controlling variables across variants, and evaluates against explicit criteria. Maintains decision notes and version history that document tradeoffs and preserve reusable rules. Converges by narrowing options through review against criteria and validation against constraints (format specs, content variability, accessibility) rather than by accumulating unstructured tweaks."
  }
}
