{
  "market_focus": {
    "low": "Targets accounts and segments opportunistically without a stated ideal customer profile (ICP) or prioritization rule. Spends time on leads that lack a plausible use case, budget path, or buying motion for the offering. Cannot articulate which signals disqualify an account early, so effort is spread thin across low-probability opportunities.",
    "medium": "Defines an ICP and basic prioritization signals (e.g., firmographics, triggers, tech stack, role relevance) and uses them to guide outreach and account selection. Applies qualification criteria to reduce obvious mismatch, but prioritization is not consistently updated as new learnings emerge. Can focus on higher-likelihood segments, though time allocation still drifts toward inbound noise or late-stage urgency.",
    "high": "Operates from an explicit ICP and segmentation model that drives account selection, messaging angles, and time allocation. Uses disqualifying signals early and documents why an account is (or is not) a fit, keeping effort concentrated on high-likelihood opportunities. Updates targeting based on observed conversion patterns and market feedback, and can explain the expected path to revenue for the chosen segments."
  },
  "outreach": {
    "low": "Runs outreach that is mostly generic and feature-led, with limited adaptation to role, industry, or trigger context. Follow-up is inconsistent; next actions are often not scheduled or are dropped after initial non-response. Activity is hard to connect to measurable pipeline creation because contact attempts, responses, and outcomes are not tracked reliably.",
    "medium": "Uses repeatable outreach sequences with role-relevant messaging and basic personalization tied to a trigger or hypothesis. Tracks activity and outcomes sufficiently to iterate on templates and channels, and sustains follow-up through multiple touches. Can generate meetings from outbound, though conversion varies and iteration is not consistently driven by structured experiments.",
    "high": "Builds outreach around testable hypotheses (persona pain, trigger, value claim) and iterates based on measured response and meeting-conversion rates. Personalization is used to strengthen a specific buying rationale rather than to add surface detail. Maintains consistent multi-channel follow-up with tight execution and clear tracking from outreach to qualified pipeline outcomes."
  },
  "discovery": {
    "low": "Runs discovery as a product tour or checklist without establishing the buyer's current state, impact, constraints, and decision process. Leaves meetings without verified problem severity, success criteria, stakeholders, or timeline. Notes and outcomes are incomplete, making it difficult to advance deals with a consistent rationale.",
    "medium": "Elicits core pains, desired outcomes, and basic buying process information, and can summarize why a deal might be worth pursuing. Captures key constraints and can identify missing information for the next interaction. However, discovery sometimes stops at surface needs without quantifying impact or validating decision dynamics across stakeholders.",
    "high": "Structures discovery to confirm problem existence, business impact, urgency, constraints, and the decision process (stakeholders, criteria, procurement, risks). Quantifies outcomes where feasible and ties them to the buyer's operating metrics and priorities. Produces a documented, buyer-verified summary that becomes the basis for positioning, mutual plans, and qualification."
  },
  "positioning": {
    "low": "Positions primarily via features and generic benefits without mapping to the buyer's quantified outcomes and constraints. Proposals and demos are not anchored to decision criteria, so differentiation is unclear. Uses cases and proof points inconsistently, limiting credibility with skeptical stakeholders.",
    "medium": "Connects product capabilities to stated pains and outcomes and uses relevant examples, references, or ROI logic to support the claim. Tailors messaging by persona and can explain differentiation at a high level. However, positioning is not consistently aligned to the buyer's evaluation criteria and risk concerns, and proof is not always matched to the strongest objections.",
    "high": "Positions around the buyer's decision criteria, quantified outcomes, and risk posture, using evidence that matches the specific use case (case studies, pilots, security/compliance artifacts, benchmarks). Demonstrates differentiation in the context of alternatives and the buyer's constraints. Produces materials (decks, proposals, business cases) that stakeholders can reuse internally to drive consensus."
  },
  "navigation": {
    "low": "Engages mainly a single contact and does not map the stakeholder set, influence paths, or internal approval steps. Communication does not adapt to different roles (economic buyer, technical buyer, user, procurement). Deals stall due to unaddressed internal objections or missing champions.",
    "medium": "Identifies key stakeholders and can secure access to technical and business participants when prompted by deal needs. Adjusts content and meeting goals by persona and can support a champion with basic internal materials. However, stakeholder mapping and influence strategy are not consistently built early, and escalation paths are often reactive once blockers appear.",
    "high": "Maps stakeholders early (roles, incentives, concerns, influence) and runs a deliberate multi-threading strategy across business, technical, security, and procurement. Equips champions with role-specific narratives and artifacts for internal alignment. Anticipates internal friction (risk, compliance, political constraints) and uses targeted conversations and evidence to address it before it becomes a late-stage blocker."
  },
  "objections": {
    "low": "Responds to objections with reassurances or feature explanations without isolating the underlying concern (risk, fit, priority, budget, authority). Concessions are made without trading for progress or clarity, weakening leverage. Objections recur across meetings because they are not documented and resolved with agreed evidence or next steps.",
    "medium": "Clarifies objections through questioning and can match common concerns to relevant proof (security posture, implementation plan, ROI logic, references). Can reframe some objections and preserve momentum with follow-up actions. However, responses can be inconsistent across stakeholders, and resolution criteria are not always made explicit or verified.",
    "high": "Treats objections as hypotheses to validate: isolates the root cause, confirms decision impact, and sets explicit resolution criteria (what evidence or change would close the concern). Uses tailored proof and structured risk mitigation (pilot scope, security review path, implementation sequencing) to address objections. Maintains leverage by trading concessions for verified progress (access, timelines, scope clarity, commitment to next steps)."
  },
  "deal_control": {
    "low": "Advances deals through informal momentum rather than a defined sequence of commitments and decision milestones. Next steps are often vague, not time-bound, or not owned by specific parties. Late-stage surprises occur around procurement, legal, security, or implementation because these paths are not surfaced early.",
    "medium": "Uses a repeatable deal motion with defined stages and typical milestones (discovery, validation, technical evaluation, procurement). Sets next steps and can drive meetings forward, but mutual plans are not consistently adopted by the buyer. Some execution remains reactive when timelines slip or when additional stakeholders appear late.",
    "high": "Runs a mutual plan with buyer-owned milestones, clear dates, and explicit exit criteria for each stage, including procurement/legal/security and implementation readiness. Creates and maintains deal artifacts (evaluation plan, pilot scope, success criteria, commercial proposal) that keep the process predictable. Detects slippage early through milestone adherence and intervenes with specific actions (stakeholder adds, decision criteria confirmation, escalation paths)."
  },
  "forecasting": {
    "low": "Pipeline stages and close dates do not reflect verified buyer commitments or decision milestones. Forecast updates lag reality because next steps, risks, and required approvals are not recorded. Commit calls include deals without a demonstrated path through procurement and signature, leading to frequent misses.",
    "medium": "Maintains basic CRM hygiene (stage, close date, next step, primary risks) and updates forecasts when material changes occur. Can distinguish early pipeline from late-stage opportunities using qualification signals, though definitions are applied inconsistently. Forecast accuracy improves with guidance and periodic deal reviews that surface missing milestones.",
    "high": "Forecasts from evidence: mapped stakeholders, verified decision criteria, dated milestones, identified approval paths, and explicit buyer commitments. Uses consistent stage definitions tied to exit criteria and updates close dates based on milestone progress rather than optimism or pressure. Surfaces risks early (procurement, legal, security, budget cycles, competing priorities) with mitigation plans and maintains forecast accuracy over time."
  }
}
